/************************************************* 
    Copyright (C), 2013, Hnist FS_GCZX. 
  	File name: delay.c     
  	Author:Hnist FS_GCZX       Version:13.11        Date: 2013.11.30
  	Description: 该文件为LPC1768的自定义延时函数库
	               包括S、mS及uS级延时函数
				         所有函数均具备形参检测功能	             			 
*************************************************/
#include "../system_h/lpc17xx.h"
#include "../system_h/stdint.h"
#include "../inc/delay.h"

/************************************************* 
    Function:Delay1uS() 	
  	Description:精确延时1uS
*************************************************/
void Delay1uS(void)		// 1uS精确延时 //
{
}

/************************************************* 
    Function:DelayuS() 
  	Description:uS级延时
  	Input:           
        uint16_t uS, 延时uS数，取值范围2-999
*************************************************/
void DelayuS(uint16_t uS)		// uS级延时 //
{
}

/************************************************* 
    Function:Delay1mS() 
  	Description:精确延时1mS
*************************************************/
void Delay1mS(void)		// 1mS精确延时 //
{
}

/************************************************* 
    Function:DelaymS() 
  	Description:uS级延时
  	Input:           
        uint16_t mS, 延时mS数，取值范围2-999
*************************************************/
void DelaymS(uint16_t mS)		// mS级延时 //
{
}

/************************************************* 
    Function:Delay1S() 
  	Description:精确延时1S
*************************************************/
void Delay1S(void)		// 1S精确延时 //
{
}

/************************************************* 
    Function:DelayS() 
  	Description:S级延时
  	Input:           
        uint8_t S, 延时S数，取值范围2-255
*************************************************/
void DelayS(uint8_t S)		// S级延时 //
{
}

/************************************************* 
  	End of delay.c     
*************************************************/
